vmud20/vmud20.github.io/dataset/macros4sig/qemu/macro_81b23ef82cd1be29ca3d69ab7e98b5b5e55926ce~1_f2893b28aa-xen_pt.c.h
#define kvm_async_interrupts_enabled() (false)
#define kvm_enabled()           (0)
#define kvm_eventfds_enabled() (false)
#define kvm_gsi_direct_mapping() (kvm_gsi_direct_mapping)
#define kvm_gsi_routing_allowed() (false)
#define kvm_gsi_routing_enabled() (kvm_gsi_routing_allowed)
#define kvm_halt_in_kernel() (false)
#define kvm_irqchip_in_kernel() (false)
#define kvm_irqfds_enabled() (kvm_irqfds_allowed)
#define kvm_msi_via_irqfd_enabled() (kvm_msi_via_irqfd_allowed)
#define kvm_readonly_mem_enabled() (kvm_readonly_mem_allowed)
#define kvm_resamplefds_enabled() (kvm_resamplefds_allowed)
#define kvm_vcpu_enable_cap(cpu, capability, cap_flags, ...)         \
    ({                                                               \
        struct kvm_enable_cap cap = {                                \
            .cap = capability,                                       \
            .flags = cap_flags,                                      \
        };                                                           \
        uint64_t args_tmp[] = { __VA_ARGS__ };                       \
        int i;                                                       \
        for (i = 0; i < (int)ARRAY_SIZE(args_tmp) &&                 \
                     i < ARRAY_SIZE(cap.args); i++) {                \
            cap.args[i] = args_tmp[i];                               \
        }                                                            \
        kvm_vcpu_ioctl(cpu, KVM_ENABLE_CAP, &cap);                   \
    })
#define kvm_vm_enable_cap(s, capability, cap_flags, ...)             \
    ({                                                               \
        struct kvm_enable_cap cap = {                                \
            .cap = capability,                                       \
            .flags = cap_flags,                                      \
        };                                                           \
        uint64_t args_tmp[] = { __VA_ARGS__ };                       \
        int i;                                                       \
        for (i = 0; i < (int)ARRAY_SIZE(args_tmp) &&                 \
                     i < ARRAY_SIZE(cap.args); i++) {                \
            cap.args[i] = args_tmp[i];                               \
        }                                                            \
        kvm_vm_ioctl(s, KVM_ENABLE_CAP, &cap);                       \
    })

#define BDRV_BLOCK_ALLOCATED    0x10
#define BDRV_BLOCK_DATA         0x01
#define BDRV_BLOCK_OFFSET_MASK  BDRV_SECTOR_MASK
#define BDRV_BLOCK_OFFSET_VALID 0x04
#define BDRV_BLOCK_RAW          0x08
#define BDRV_BLOCK_ZERO         0x02
#define BDRV_O_ALLOW_RDWR  0x2000  
#define BDRV_O_CACHE_MASK  (BDRV_O_NOCACHE | BDRV_O_CACHE_WB | BDRV_O_NO_FLUSH)
#define BDRV_O_CACHE_WB    0x0040 
#define BDRV_O_CHECK       0x1000  
#define BDRV_O_COPY_ON_READ 0x0400 
#define BDRV_O_INCOMING    0x0800  
#define BDRV_O_NATIVE_AIO  0x0080 
#define BDRV_O_NOCACHE     0x0020 
#define BDRV_O_NO_BACKING  0x0100 
#define BDRV_O_NO_FLUSH    0x0200 
#define BDRV_O_PROTOCOL    0x8000  
#define BDRV_O_RDWR        0x0002
#define BDRV_O_SNAPSHOT    0x0008 
#define BDRV_O_TEMPORARY   0x0010 
#define BDRV_O_UNMAP       0x4000  
#define BDRV_REQUEST_MAX_SECTORS MIN(SIZE_MAX >> BDRV_SECTOR_BITS, \
                                     INT_MAX >> BDRV_SECTOR_BITS)
#define BDRV_SECTOR_BITS   9
#define BDRV_SECTOR_MASK   ~(BDRV_SECTOR_SIZE - 1)
#define BDRV_SECTOR_SIZE   (1ULL << BDRV_SECTOR_BITS)
#define BLKDBG_EVENT(bs, evt) bdrv_debug_event(bs, evt)



#define BLKIF_OP_DISCARD 5
#define HVM_PARAM_BUFIOREQ_EVTCHN 26
#define IOREQ_TYPE_PCI_CONFIG 2
#define QEMU_HW_XEN_COMMON_H 1
#  define XC_HANDLER_INITIAL_VALUE    NULL
#  define XC_INTERFACE_FMT "%p"

#  define HVM_MAX_VCPUS 32
#define QEMU_HW_XEN_H 1
#define DEVOPS_FLAG_IGNORE_STATE  2
#define DEVOPS_FLAG_NEED_GNTDEV   1
#define QEMU_HW_XEN_BACKEND_H 1
#define XEN_BUFSIZE 1024
#define DEFAULT_BRIDGE_HELPER CONFIG_QEMU_HELPERDIR "/qemu-bridge-helper"
#define DEFAULT_BRIDGE_INTERFACE "br0"
#define DEFAULT_NETWORK_DOWN_SCRIPT "/etc/qemu-ifdown"
#define DEFAULT_NETWORK_SCRIPT "/etc/qemu-ifup"
#define DEFINE_NIC_PROPERTIES(_state, _conf)                            \
    DEFINE_PROP_MACADDR("mac",   _state, _conf.macaddr),                \
    DEFINE_PROP_VLAN("vlan",     _state, _conf.peers),                   \
    DEFINE_PROP_NETDEV("netdev", _state, _conf.peers)
#define MAX_NICS 8
#define MAX_QUEUE_NUM 1024
#define NET_BUFSIZE (4096 + 65536)
#define POLYNOMIAL 0x04c11db6

#define VMSTATE_MACADDR(_field, _state) {                            \
    .name       = (stringify(_field)),                               \
    .size       = sizeof(MACAddr),                                   \
    .info       = &vmstate_info_buffer,                              \
    .flags      = VMS_BUFFER,                                        \
    .offset     = vmstate_offset_macaddr(_state, _field),            \
}
#define vmstate_offset_macaddr(_state, _field)                       \
    vmstate_offset_array(_state, _field.a, uint8_t,                \
                         sizeof(typeof_field(_state, _field)))
#define QEMU_NET_PACKET_FLAG_NONE  0
#define QEMU_NET_PACKET_FLAG_RAW  (1<<0)

#define MAX_CPUMASK_BITS 255
#define MAX_NODES 128
#define MAX_OPTION_ROMS 16
#define MAX_PARALLEL_PORTS 3
#define MAX_PROM_ENVS 128
#define MAX_SERIAL_PORTS 4

#define UUID_FMT "%02hhx%02hhx%02hhx%02hhx-%02hhx%02hhx-%02hhx%02hhx-%02hhx%02hhx-%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx"
#define UUID_NONE "00000000-0000-0000-0000-000000000000"
#define VMRESET_REPORT   true
#define VMRESET_SILENT   false
#define xenfb_enabled (vga_interface_type == VGA_XENFB)
#define QEMU_MAIN_LOOP_H 1
#define SIG_IPI SIGUSR1
